---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.HeatTransferCoefficient
source: html/bd9fa292-8578-7f79-27e1-c9ea2eb4d387.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.HeatTransferCoefficient Property

The heat transfer coefficient value (U-value) of the window type.

## Syntax (C#)
```csharp
public double HeatTransferCoefficient { get; }
```